---
kind: other
id: Methods.T:Autodesk.Revit.DB.SymbolicCurve
source: html/17734525-9aa3-6918-0dba-a8641056a35a.htm
---
# SymbolicCurve Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.